Revit 2027 API
PlasticvinylApplicationType Enumeration
 The enumerated type representing the permitted values for the asset property "PlasticvinylApplication" from the "PlasticVinyl" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum PlasticvinylApplicationType
Public Enumeration PlasticvinylApplicationType
public enum class PlasticvinylApplicationType
type PlasticvinylApplicationType
Members
Member name | Value | Description
Glossy | 1
Matte | 2
Polished | 0
See Also
Reference
Autodesk.Revit.DB.Visual Namespace